tutorials/2DChannels/10_baseCasePimple/0.org/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

// internalField   uniform 0.001;                                           //lean
internalField   uniform 0.00;                                           //lean
// internalField   uniform 0.005;                                           //lean
//~ internalField   uniform 0.0005;                                         //stoich

boundaryField
{
    inlet
    {
        type            fixedValue;
        // value           uniform 0.001;                                   //lean
        // value           uniform 0.005;                                 //stoich
        value           uniform 0.000;                                 //stoich
    }
    
    "(outlet|walls|inletCyl|cylinder)"
    {
        type        zeroGradient;
    }

    "(symmetry.*)"
//  channelOfInt1 
   {
        type            symmetryPlane;
    }

}

// ************************************************************************* //
