tutorials/2DChannels/10_baseCasePimple/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

//~ nu	[0 2 -1 0 0 0 0]	0.00004343;

//~ species (CO O2 NO CO2 N2 N2O);
species (CO O2 CO2 N2);

diffusionType Fick;

zones (wall coat);
//~ species (NO N2 N2O CO2 CO O2);
ref
{
    // -- reference diffusion volume in m3mol-1 for diffusivity computations (see Fuller)
    sigmaV      16.2;           
    
    molM        28.01e-3;    

    // -- thermal conductivity polynom coeficients for reference gas Wm-1K-1
    // -- kappaGas = kappaA+kappaB*T+kappaC*Foam::pow(T,2)+kappaD*Foam::pow(T,3)
    kappaA  kappaA  [1 1 -3 -1 0 0 0] 0.3918e-3;                             
    kappaB  kappaB  [1 1 -3 -2 0 0 0] 0.9814e-4;                              
    kappaC  kappaC  [1 1 -3 -3 0 0 0] -5.0660e-8;                             
    kappaD  kappaD  [1 1 -3 -4 0 0 0] 1.503479e-11;    

    //specific heat of the substrate in Jkg-1K-1
    // Cp	    Cp 	    [0  2  -2   -1  0 0 0]  520.65;                       
}

N2
{
    // -- reference diffusion volume in m3mol-1 for diffusivity computations (see Fuller)
    sigmaV      16.2;           
    
    molM        28.01e-3;   
    nuVec       (0.0);                     
}

CO
{
    sigmaV      18.0;                                                   

    // -- molar mass in kgmol-1
    molM        28.01e-3;

    // -- stoichiometric coefficients in reactions
    // minForGrad  1e-36;                                                   //min for gradien
    nuVec       (-1.0);                                                     //row of the stoechiometric matrix                                                   
}

O2
{
    sigmaV      16.3;                                                   

    molM        32.0e-3;
    
    minForGrad  1e-36;
    nuVec       (-0.5);                                                
    alphaVec    (1.0);                                               
}

CO2
{
    sigmaV      16.3;                                                   

    molM        28.96e-3;                                              
    
    //---
    minForGrad  1e-36;
    nuVec       (1.0);                                                  //row of the stoechiometric matrix                                             
}


wall
{
    porEps  porEps  [0 0 0 0 0 0 0] 0.42;
    constr  constr  [0 0 0 0 0 0 0] 1.0;                                //constrictivity   //for elimination set to 1.0
    tort    tort    [0 0 0 0 0 0 0] 3.0;                                //tortuosity
    dP	dP	[0 1 0 0 0 0 0] 1.91e-5;									//Mean pore size of on-wall catalytic coating (m) -- XPF
    kappa  kappa  [1 1 -3 -1 0 0 0] 6;                              //thermal conductivity of substrate Wm-1K-1
    Cp      Cp      [0 2 -2 -1 0 0 0] 800;                            //specific heat of the substrate Jkg-1K-1
    rho     rho     [1 -3 0 0 0 0 0] 2030.0;                            //efective density in kgm-3 (assumed constant)
    coatFrac     coatFrac     [0 0 0 0 0 0 0] 0.0;                            //coating fraction in zone
    kH    kH    [1 0 -3 -1 0 0 0]         200;                                          //heat transfer coefficient
    a    a   [0 -1 0 0 0 0 0]         40000;                                          //specific area
}

coat    
{
    porEps  porEps  [0 0 0 0 0 0 0] 0.3;                                //coating porosity
    constr  constr  [0 0 0 0 0 0 0] 1.0;                                //constrictivity   //for elimination set to 1.0
    tort    tort    [0 0 0 0 0 0 0] 4.0;                               //tortuosity
    dP	dP	[0 1 0 0 0 0 0] 1.0e-6;										//Mean pore size of on-wall catalytic coating (m) -- XPF
    kappa  kappa  [1 1 -3 -1 0 0 0] 6;                              //thermal conductivity of coating in Wm-1K-1
    Cp      Cp      [0 2 -2 -1 0 0 0] 962;                            //specific heat of the substrate in Jkg-1K-1
    rho     rho     [1 -3 0 0 0 0 0] 1000.0;                            //efective density in kgm-3 (assumed constant)
    coatFrac     coatFrac     [0 0 0 0 0 0 0] 1.0;                            //coating fraction in zone
    kH    kH    [1 0 -3 -1 0 0 0]         200;                                          //heat transfer coefficient
    a    a   [0 -1 0 0 0 0 0]         40000;                                          //specific area
}

lOncoat    
{
    porEps  porEps  [0 0 0 0 0 0 0] 0.3;                                //coating porosity
    constr  constr  [0 0 0 0 0 0 0] 1.0;                                //constrictivity   //for elimination set to 1.0
    tort    tort    [0 0 0 0 0 0 0] 4.0;                               //tortuosity
    dP	dP	[0 1 0 0 0 0 0] 1.0e-6;										//Mean pore size of on-wall catalytic coating (m) -- XPF
    kappa  kappa  [1 1 -3 -1 0 0 0] 6;                              //thermal conductivity of coating in Wm-1K-1
    Cp      Cp      [0 2 -2 -1 0 0 0] 962;                            //specific heat of the substrate in Jkg-1K-1
    rho     rho     [1 -3 0 0 0 0 0] 1000.0;                            //efective density in kgm-3 (assumed constant)
    coatFrac     coatFrac     [0 0 0 0 0 0 0] 0.0;                            //coating fraction in zone
    kH    kH    [1 0 -3 -1 0 0 0]         200;                                          //heat transfer coefficient
    a    a   [0 -1 0 0 0 0 0]         40000;                                          //specific area
}

// Deff = D*porEps*constr/tort - estimate for the effective diffusivity in coating
// Deff - random pore model N. Wakao, J.M. Smith, Chemical Engineering Science, 17 (1962)
// D - N. Wakao, J.M. Smith, Chemical Engineering Science, 17 (1962)

// -- general constants
genProps
{
    univR   univR   [1  2 -2 -1 -1 0 0]  8.31446261815324;
}

// ************************************************************************* //
