tutorials/2DChannels/10_baseCasePimple/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//application     flowDCRcoupleNew;
// application     nonIsoFlowDCR;
// application     reactingHetCatSimpleFoamPMT;
// application     reactingHetCatPimpleFoamFC;
// application     reactingHetCatSimpleFoamFC;
application     reactingHetCatPimpleFoamFC;
// application     rhoPorousSimpleFoam;

startFrom       latestTime;

startTime 	500;

stopAt          endTime;
//stopAt          writeNow;

endTime	0.5;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval 	0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo          0.5;


// ************************************************************************* //

functions
{
      #include "residuals"
}
